#pragma once

// 繝懊・繝翫せ繧ｹ繧ｳ繧｢險育ｮ励ｄUI陦ｨ遉ｺ縺ｮ縺溘ａ繧ｳ繝ｳ繝懃憾諷九ｒ邂｡逅・☆繧・
class Combo
{
public:
	Combo();
	~Combo();

	/*
	 * @brief 繧ｳ繝ｳ繝懈焚縺ｨ繝ｭ繧ｴ繧旦I縺ｨ縺励※謠冗判縺吶ｋ
	 * [蜈･蜉嫋 縺ｪ縺・
	 * [蜃ｺ蜉嫋 縺ｪ縺・
	 * [蜑ｯ菴懃畑] 縺ｪ縺・
	 */
	void Draw();

	/*
	 * @brief 繧ｳ繝ｳ繝懃ｶ咏ｶ壼愛螳壹・縺溘ａ豈弱ヵ繝ｬ繝ｼ繝迥ｶ諷九ｒ譖ｴ譁ｰ縺吶ｋ
	 * [蜈･蜉嫋 縺ｪ縺・
	 * [蜃ｺ蜉嫋 縺ｪ縺・
	 * [蜑ｯ菴懃畑] 譎る俣蛻・ｌ譎ゅ↓Reset()繧貞他縺ｳ蜃ｺ縺励さ繝ｳ繝懃憾諷九ｒ遐ｴ譽・
	 */
	void Update();

	/*
	 * @brief 迯ｲ迚ｩ迯ｲ蠕玲凾縺ｫ繧ｳ繝ｳ繝懃憾諷九ｒ譖ｴ譁ｰ繝ｻ邯ｭ謖√☆繧・
	 * [蜈･蜉嫋 縺ｪ縺・
	 * [蜃ｺ蜉嫋 縺ｪ縺・
	 * [蜑ｯ菴懃畑] comboCount繧偵う繝ｳ繧ｯ繝ｪ繝｡繝ｳ繝医＠縲√ち繧､繝槭・繧貞・譛溷､縺ｫ謌ｻ縺・
	 */
	void AddHit();

	/*
	 * @brief 繧ｳ繝ｳ繝懃幻莠域凾髢楢ｶ・℃縺ｪ縺ｩ縺ｮ逅・罰縺ｧ迥ｶ諷九ｒ蛻晄悄蛹悶☆繧・
	 * [蜈･蜉嫋 縺ｪ縺・
	 * [蜃ｺ蜉嫋 縺ｪ縺・
	 * [蜑ｯ菴懃畑] comboCount繧・縺ｫ繝ｪ繧ｻ繝・ヨ
	 */
	void Reset();

	int GetCombo() const;
	float GetMultiplier() const;

private:
	int combo_count_;             // 繧ｹ繧ｳ繧｢蛟咲紫險育ｮ励・蝓ｺ貅悶→縺ｪ繧矩｣邯壹ヲ繝・ヨ謨ｰ
	float combo_timer_;           // 0莉･荳九〒繧ｳ繝ｳ繝懊ｒ邨ゆｺ・＆縺帙ｋ縺溘ａ縺ｮ逶｣隕也畑繧ｿ繧､繝槭・
	float combo_max_time_;         // 髮｣譏灘ｺｦ隱ｿ謨ｴ縺ｮ蝓ｺ貅悶→縺ｪ繧九さ繝ｳ繝懃ｶｭ謖∫幻莠域凾髢・

	int combo_image_;             // 謠冗判雋闕ｷ霆ｽ貂帙・縺溘ａ菫晄戟縺励※縺翫￥繝ｭ繧ｴ逕ｻ蜒上ワ繝ｳ繝峨Ν
	bool combo_show_;             // UI縺ｮ陦ｨ遉ｺ/髱櫁｡ｨ遉ｺ繧貞・繧頑崛縺医ｋ縺溘ａ縺ｮ繝輔Λ繧ｰ
	float combo_show_timer_;       // 繧｢繝九Γ繝ｼ繧ｷ繝ｧ繝ｳ縺ｪ縺ｩ縺ｮ陦ｨ遉ｺ貍泌・繧堤ｮ｡逅・☆繧区凾髢・
};
