#pragma once
#include "DxLib.h"

// 繝・ヰ繝・げ逕ｨ縺ｮ荳莠ｺ遘ｰ隕也せ・医せ繝壹け繝・う繧ｿ繝ｼ・峨・閾ｪ逕ｱ遘ｻ蜍輔き繝｡繝ｩ蛻ｶ蠕｡繧ｯ繝ｩ繧ｹ
class DebugCamera
{
public:
	/*
	 * @brief 繝｡繝ｳ繝仙､画焚繧貞・譛溷ｺｧ讓吶→繝・ヵ繧ｩ繝ｫ繝郁ｧ貞ｺｦ縺ｫ蛻晄悄蛹悶☆繧・
	 * [蜈･蜉嫋 なし
	 * [蜃ｺ蜉嫋 なし
	 * [蜑ｯ菴懃畑] なし
	 */
	DebugCamera();
	~DebugCamera();

	/*
	 * @brief 迴ｾ蝨ｨ縺ｮ繧｢繧ｯ繝・ぅ繝悶↑繧ｲ繝ｼ繝繧ｫ繝｡繝ｩ縺ｮ菴咲ｽｮ縺ｨ隗貞ｺｦ繧貞ｼ輔″邯吶＞縺ｧ繝・ヰ繝・げ繧ｫ繝｡繝ｩ繧貞・譛溯ｨｭ螳壹☆繧・
	 * [蜈･蜉嫋 なし
	 * [蜃ｺ蜉嫋 なし
	 * [蜑ｯ菴懃畑] 繧ｫ繝｡繝ｩ蠎ｧ讓吶→隗貞ｺｦ螟画焚縺ｮ蛻晄悄險ｭ螳・
	 */
	void Initialize();

	/*
	 * @brief 繧ｭ繝ｼ繝懊・繝牙・蜉・WASD / LSHIFT)縺ｫ繧医ｋ遘ｻ蜍輔→縲√・繧ｦ繧ｹ縺ｫ繧医ｋ隕也せ蝗櫁ｻ｢繧呈峩譁ｰ縺励．X繝ｩ繧､繝悶Λ繝ｪ縺ｮ繧ｫ繝｡繝ｩ繧呈峩譁ｰ縺吶ｋ
	 * [蜈･蜉嫋 なし
	 * [蜃ｺ蜉嫋 なし
	 * [蜑ｯ菴懃畑] DX繝ｩ繧､繝悶Λ繝ｪ縺ｮ3D繧ｫ繝｡繝ｩ迥ｶ諷九・險ｭ螳壼､画峩
	 */
	void Update();

	/*
	 * @brief 繝槭え繧ｹ縺ｮ遘ｻ蜍暮㍼縺ｫ蠢懊§縺ｦ縲∵ｰｴ蟷ｳ隗貞ｺｦ縺ｨ蝙ら峩隗貞ｺｦ縺ｮ蝗櫁ｻ｢驥上ｒ譖ｴ譁ｰ縺吶ｋ
	 * [蜈･蜉嫋 なし
	 * [蜃ｺ蜉嫋 なし
	 * [蜑ｯ菴懃畑] 豌ｴ蟷ｳ・蝙ら峩蝗櫁ｻ｢隗貞ｺｦ螟画焚縺ｮ譖ｴ譁ｰ縲√・繧ｦ繧ｹ繝昴う繝ｳ繧ｿ縺ｮ逕ｻ髱｢荳ｭ必要∈縺ｮ蠑輔″謌ｻ縺・
	 */
	void UpdateRotate();

private:
	VECTOR position_;        // 繝・ヰ繝・げ繧ｫ繝｡繝ｩ縺ｮ迴ｾ蝨ｨ蠎ｧ讓・
	float horizontal_angle_;  // 豌ｴ蟷ｳ・亥ｷｦ蜿ｳ繝ｨ繝ｼ・牙屓霆｢隗貞ｺｦ
	float vertical_angle_;    // 蝙ら峩・井ｸ贋ｸ九ヴ繝・メ・牙屓霆｢隗貞ｺｦ
};
