#pragma once

// 繧ｲ繝ｼ繝蜀・・繝輔ぅ繝ｼ繝舌・迥ｶ諷具ｼ井ｸ螳壽凾髢灘精蠑募ｼｷ蛹悶・驥醍央縺ｮ騾｣邯壼・迴ｾ・峨ｒ邂｡逅・☆繧九け繝ｩ繧ｹ
class Fever
{
public:
	/*
	 * @brief 繝輔ぅ繝ｼ繝舌・迥ｶ諷狗ｮ｡逅・､画焚繧貞・譛溷喧縺怜ｮ牙・縺ｪ迥ｶ諷九ｒ菴懊ｋ
	 * [蜈･蜉嫋 なし
	 * [蜃ｺ蜉嫋 なし
	 * [蜑ｯ菴懃畑] なし
	 */
	Fever();
	~Fever();

	/*
	 * @brief 繝輔ぅ繝ｼ繝舌・荳ｭ縺ｮ逕ｻ髱｢貍泌・縺翫ｈ縺ｳ驥醍央縺ｮ蜻ｨ譛溽函謌舌ｒ陦後≧
	 * [蜈･蜉嫋 なし
	 * [蜃ｺ蜉嫋 なし
	 * [蜑ｯ菴懃畑] 繧ｹ繧ｯ繝ｪ繝ｼ繝ｳ縺ｮ謠冗判繝悶Ξ繝ｳ繝芽ｨｭ螳壼､画峩縲∫央繧ｪ繝悶ず繧ｧ繧ｯ繝医・逕滓・縲√ち繧､繝槭・貂帷ｮ・
	 */
	void Update();

	/*
	 * @brief 繝輔ぅ繝ｼ繝舌・繧ｲ繝ｼ繧ｸ繧貞｢怜刈縺輔○繧具ｼ亥ｰ・擂逕ｨ・・
	 * [蜈･蜉嫋 value: 蠅怜刈驥・
	 * [蜃ｺ蜉嫋 なし
	 * [蜑ｯ菴懃畑] 繧ｲ繝ｼ繧ｸ蛟､縺ｮ螟牙虚
	 */
	void AddGauge(int value);

	/*
	 * @brief 迴ｾ蝨ｨ繝輔ぅ繝ｼ繝舌・迥ｶ諷九〒縺ゅｋ縺九ｒ蜿門ｾ励☆繧・
	 * [蜈･蜉嫋 なし
	 * [蜃ｺ蜉嫋 繝輔ぅ繝ｼ繝舌・荳ｭ縺ｪ繧液rue
	 * [蜑ｯ菴懃畑] なし
	 */
	bool IsFever();

	/*
	 * @brief 繝励Ξ繧､繝､繝ｼ縺ｮ謾ｻ謦・鴨繧貞榊刈縺励ヵ繧｣繝ｼ繝舌・迥ｶ諷九∈遘ｻ陦後☆繧・
	 * [蜈･蜉嫋 なし
	 * [蜃ｺ蜉嫋 なし
	 * [蜑ｯ菴懃畑] 繝励Ξ繧､繝､繝ｼ謾ｻ謦・せ繝・・繧ｿ繧ｹ縺ｮ蛟榊刈縲√ち繧､繝槭・險ｭ螳壹√ヵ繧｣繝ｼ繝舌・繝輔Λ繧ｰON
	 */
	void StartFever(class Player3D* player);

	/*
	 * @brief 繝励Ξ繧､繝､繝ｼ閭ｽ蜉帙ｒ蜈・↓謌ｻ縺励せ繝・・繧ｸ荳翫↓蛻晄悄縺ｮ迯ｲ迚ｩ繧定｣懷・縺吶ｋ
	 * [蜈･蜉嫋 なし
	 * [蜃ｺ蜉嫋 なし
	 * [蜑ｯ菴懃畑] 繝励Ξ繧､繝､繝ｼ謾ｻ謦・せ繝・・繧ｿ繧ｹ縺ｮ蠕ｩ蜈・∝推遞ｮ繧｢繧ｯ繧ｿ繝ｼ縺ｮ譁ｰ隕冗函謌舌√ヵ繧｣繝ｼ繝舌・繝輔Λ繧ｰOFF
	 */
	void EndFever();

private:
	int drop_time_;       // 髮｣譏灘ｺｦ縺翫ｈ縺ｳ繧ｹ繧ｳ繧｢隱ｿ謨ｴ縺ｮ縺溘ａ縺ｮ驥醍央繧ｹ繝昴・繝ｳ髢馴囈
	int drop_count_;      // 繧ｹ繝昴・繝ｳ蜻ｨ譛溘ｒ邂｡逅・☆繧九◆繧√・繝輔Ξ繝ｼ繝繧ｫ繧ｦ繝ｳ繧ｿ繝ｼ
	int gauge_;         // UI陦ｨ遉ｺ繧・ヵ繧｣繝ｼ繝舌・逋ｺ蜍募愛螳壹↓逕ｨ縺・ｋ繧ｲ繝ｼ繧ｸ闢・ｩ榊､
	int timer_;         // 繝輔ぅ繝ｼ繝舌・邨ゆｺ・愛螳壹↓逕ｨ縺・ｋ谿九ｊ邯咏ｶ壹ヵ繝ｬ繝ｼ繝謨ｰ
	bool is_fever_;      // 莉悶け繝ｩ繧ｹ縺九ｉ迥ｶ諷九ｒ蜿ら・・蛻・ｲ舌＆縺帙ｋ縺溘ａ縺ｮ繝輔Λ繧ｰ
	float player_status_;
	class Player3D* fever_player_; // 邨ゆｺ・凾縺ｫ繧ｹ繝・・繧ｿ繧ｹ繧貞ｾｩ蜈・☆繧九◆繧√・蟇ｾ雎｡繝励Ξ繧､繝､繝ｼ繝昴う繝ｳ繧ｿ
};
